Identifier: com.github.autopkg.wardsparadox.install.Ghostty
Description: A recipe to install https://github.com/ghostty-org/ghostty/
ParentRecipe: com.github.autopkg.wardsparadox.download.Ghostty
MinimumVersion: "2.3"

Input:
  NAME: Ghostty.app

Process:
  - Processor: InstallFromDMG
    Arguments:
      dmg_path: "%pathname%"
      items_to_copy:
        - source_item: Ghostty.app
          destination_path: "/Applications"
