<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release of Vernier's Graphical Analysis.</string>
    <key>Identifier</key>
    <string>com.github.wardsparadox.download.vernier.graphicalanalysis</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>verniergraphicalanalysis</string>
      <key>CHECK_PAGE_URL</key>
      <string>https://www.vernier.com/products/software/graphical-analysis/</string>
      <key>CHECK_PAGE_PATTERN</key>
        <string>(?P&lt;url&gt;https://software-releases.graphicalanalysis.com/ga/mac/release/Vernier-Graphical-Analysis-(?P&lt;version&gt;[\d.-]+)\.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>DeprecationWarning</string>
        <key>Arguments</key>
        <dict>
          <key>warning_message</key>
          <string>Consider switching to the VernierGraphicalAnalysis recipes in the nstrauss-recipes repo. This recipe is deprecated and will be removed in the future.</string>
        </dict>
      </dict>
      <dict>
      	<key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%CHECK_PAGE_URL%</string>
          <key>re_pattern</key>
          <string>%CHECK_PAGE_PATTERN%</string>
          <key>re_flags</key>
          <array>
            <string>IGNORECASE</string>
          </array>
        </dict>
      </dict>
      <dict>
         <key>Processor</key>
         <string>URLDownloader</string>
         <key>Arguments</key>
         <dict>
            <key>filename</key>
            <string>%NAME%-%version%.dmg</string>
            <key>url</key>
            <string>%url%</string>
         </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%pathname%/Vernier*.*app</string>
          <key>requirement</key>
          <string>identifier "Vernier.GraphicalAnalysis" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "75WN2B2WR8"</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
