<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and Vernier Graphical Analysis into Munki Repo</string>
    <key>Identifier</key>
    <string>com.github.wardsparadox.munki.vernier.graphicalanalysis</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>applications/vernier</string>
        <key>NAME</key>
        <string>verniergraphicalanalysis</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>&lt;h1&gt;Graphical Analysis 4 is a tool for science students to collect, graph, and analyze data from Vernier sensors.&lt;/h1&gt;

&lt;h2&gt;Key Features&lt;/h2&gt;

&lt;h3&gt;Data Collection&lt;/h3&gt;

&lt;ul&gt;

&lt;li&gt;Collect data from multiple sensors simultaneously, either with a multiple-channel interface such as LabQuest Stream or by using multiple Go Direct sensors. Use Data Sharing to retrieve data from just about every Vernier sensor.
&lt;li&gt;Select time-based or event-based data collection, including events with entry.
&lt;li&gt;Adjust data-collection rate and duration as needed.
&lt;li&gt;Trigger time-based data collection on sensor values (iOS will not support triggering or change display units in the initial 4.0 release).
&lt;li&gt;Calibrate sensors, although most of the time this is not needed.
&lt;li&gt;Enter data manually or using the clipboard.
&lt;li&gt;Change display units on many sensors.&lt;/li&gt;&lt;/ul&gt;

&lt;h3&gt;Data Analysis&lt;/h3&gt;

&lt;ul&gt;

&lt;li&gt;Display one, two, or three graphs as needed.
&lt;li&gt;Set the graph scale.
&lt;li&gt;Select what is graphed on each axis, and select line- or point-style graphs.
&lt;li&gt;Calculate descriptive statistics on all or some of your data.
&lt;li&gt;Fit lines and curves to some or all of your data.
&lt;li&gt;Define calculated columns based on sensor columns. Use this to linearize a graph, for example.
&lt;li&gt;View data in a table.
&lt;li&gt;Highlight and read values from a graph.
&lt;li&gt;Interpolate and extrapolate using graphed data.&lt;/li&gt;&lt;/ul&gt;

&lt;h3&gt;Data Sharing&lt;/h3&gt;

&lt;ul&gt;

&lt;li&gt;Receive data shared from LabQuest 2 or a computer running Logger Pro 3 to support 1:1 lab groups.&lt;/li&gt;&lt;/ul&gt;
&lt;h3&gt;Data Storage&lt;/h3&gt;
&lt;ul&gt;
&lt;li&gt;Store and retrieve previously shared data collection and analysis sessions.
&lt;li&gt;Save Graphical Analysis 4 data files with analysis for use in Logger Pro 3.&lt;/li&gt;&lt;/ul&gt;</string>
            <key>display_name</key>
            <string>Vernier Graphical Analysis</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>Vernier Software &amp; Technology, LLC.</string>
            <key>category</key>
            <string>Sciencific Analysis</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.wardsparadox.download.vernier.graphicalanalysis</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
