<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release of Vernier's Spectral Analysis.</string>
    <key>Identifier</key>
    <string>com.github.wardsparadox.download.vernier.spectralanalysis</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>vernierspectralanalysis</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>VernierURLProvider</string>
        <key>Arguments</key>
        <dict>
          <key>apptype</key>
          <string>sa</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>filename</key>
          <string>%NAME%.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Vernier*.*app</string>
          <key>requirement</key>
          <string>identifier "Vernier.SpectralAnalysis" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "75WN2B2WR8"</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
