<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads and Vernier Spectral Analysis into Munki Repo</string>
        <key>Identifier</key>
        <string>com.github.wardsparadox.munki.vernier.spectralanalysis</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>applications/vernier</string>
            <key>NAME</key>
            <string>vernierspectralanalysis</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Vernier Spectral Analysis is a tool for science students to collect and analyze data from Vernier spectrophotometers.</string>
                <key>display_name</key>
                <string>Vernier Spectral Analysis</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
                <key>developer</key>
                <string>Vernier Software &amp; Technology, LLC.</string>
                <key>category</key>
                <string>Scientific Analysis</string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.3</string>
        <key>ParentRecipe</key>
        <string>com.github.wardsparadox.download.vernier.spectralanalysis</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>AppDmgVersioner</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>split_on</key>
                    <string>-</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
                <key>Processor</key>
                <string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
