<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Installs the latest version of Pearcleaner.</string>
		<key>Identifier</key>
		<string>com.github.autopkg.wardsparadox.install.pearcleaner</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Pearcleaner</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3.0</string>
		<key>ParentRecipe</key>
		<string>com.github.autopkg.wardsparadox.pkg.pearcleaner</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>Installer</string>
			</dict>
		</array>
	</dict>
</plist>
