<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and Google Drive FileStream installer into Munki Repo</string>
    <key>Identifier</key>
    <string>com.github.wardsparadox.munki.googledrivefs</string>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.wardsparadox.download.googledrivefs</string>
   <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>DeprecationWarning</string>
        <key>Arguments</key>
        <dict>
          <key>warning_message</key>
          <string>Recipe Retired! Use apizz-recipes/GoogleDrive.munki instead and update parent recipe to com.github.apizz.munki.GoogleDrive</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
</dict>
</plist>
