<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release of Google Drive FS.</string>
    <key>Identifier</key>
    <string>com.github.wardsparadox.download.googledrivefs</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>googledrivefilestream</string>
      <key>URL</key>
      <string>https://dl.google.com/drive-file-stream/GoogleDriveFileStream.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>filename</key>
          <string>%NAME%.dmg</string>
          <key>url</key>
          <string>%URL%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Google*.*pkg</string>
          <key>expected_authority_names</key>
          <array>
            <string>Developer ID Installer: Google LLC (EQHXZ8M8AV)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
