<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of ClipGrab and Imports into Munki Repo (uses peshay's Clipgrab Download Recipe)</string>
        <key>Identifier</key>
        <string>com.github.wardsparadox.clipgrab.munki</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ClipGrab</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>applications</string>
            <key>APP_DESTINATION</key>
            <string>/Applications</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>A friendly downloader for YouTube and other sites!
                ClipGrab is a free downloader and converter for YouTube, Vimeo, Metacafe, Dailymotion and many other online video sites.
                It converts downloaded videos to MPEG4, MP3 or other formats in just one easy step.</string>
                <key>display_name</key>
                <string>ClipGrab</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>ParentRecipe</key>
        <string>com.github.peshay.download.ClipGrab</string>
        <key>Process</key>
        <array>

            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>additional_makepkginfo_options</key>
                    <array>
                        <string>--destinationpath</string>
                        <string>%APP_DESTINATION%</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
