<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Kap.
	
Valid ARCH values are:
- x86_64 (default, Intel)
- arm64 (Apple Silicon)</string>
	<key>Identifier</key>
	<string>com.github.autopkg.wardsparadox.download.Kap</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kap</string>
		<key>ARCH</key>
		<string>x86_64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%ARCH%</string>
				<key>find</key>
				<string>x86_64</string>
				<key>replace</key>
				<string>x64</string>
			</dict>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>wulkano/kap</string>
	            <key>asset_regex</key>
                <string>(Kap-[\d\.]+-%output_string%.dmg)</string>
            </dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Kap.app</string>
				<key>requirement</key>
				<string>identifier "com.wulkano.kap" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2KEEHXF6R6"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
