<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Packages the Unauthorized Versions Uninstaller tool so it will install in /private/tmp and adds a postinstall script to run it</string>
        <key>Identifier</key>
        <string>com.github.wardsparadox.munki.AdobeUninstallUnauthorizedVersions</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AdobeUninstallUnauthorizedVersions</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/Adobe</string>
            <key>pkginfo</key>
            <dict>
                <key>pkginfo</key>
                <dict>
                    <key>catalogs</key>
                    <array>
                        <string>testing</string>
                    </array>
                    <key>category</key>
                    <string>Uninstallers</string>
                    <key>description</key>
                    <string>%Description%</string>
                    <key>developer</key>
                    <string>Adobe</string>
                    <key>display_name</key>
                    <string>Adobe Unauthorized Version Removal Tool</string>
                    <key>name</key>
                    <string>%NAME%</string>
                </dict>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.1</string>
        <key>ParentRecipe</key>
        <string>com.github.neilmartin83.pkg.AdobeUninstallUnauthorizedVersions</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
