<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads and Installs Adware Medic into Munki Repo</string>
    <key>Identifier</key>
    <string>com.github.wardsparadox.adwaremedic.munki</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>utilities</string>
      <key>NAME</key>
      <string>AdwareMedic</string>
      <key>APPCAST_URL</key>
      <string>http://www.adwaremedic.com/versions/updates.xml</string>
      <key>APP_DESTINATION</key>
      <string>/Applications/Utilities</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string>
          AdMedic is an application for Mac OS X designed to remove all known adware from your computer.
          It is very simple to use, and should clean up your system in less than a minute, from start to finish.
        </string>
        <key>display_name</key>
        <string>Adware Medic</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
        <key>category</key>
        <string>Utilities</string>
        <key>developer</key>
        <string>Thomas Reed</string>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>DeprecationWarning</string>
        <key>Arguments</key>
        <dict>
          <key>warning_message</key>
          <string>This recipe is now non-functional. Please remove it from your list of recipes. Adware Medic has been purchased by MalwareBytes https://www.malwarebytes.com/mac/</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>StopProcessingIf</string>
        <key>Arguments</key>
        <dict>
          <key>predicate</key>
          <string>TRUEPREDICATE</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
