<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and Installs Adware Medic into Munki Repo</string>
    <key>Identifier</key>
    <string>com.github.wardsparadox.adwaremedic.munki</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>utilities</string>
        <key>NAME</key>
        <string>AdwareMedic</string>
        <key>APPCAST_URL</key>
        <string>http://www.adwaremedic.com/versions/updates.xml</string>
        <key>APP_DESTINIATION</key>
        <string>/Applications/Utilities</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>AdMedic is an application for Mac OS X designed to remove all known adware from your computer.
            It is very simple to use, and should clean up your system in less than a minute, from start to finish.</string>
            <key>display_name</key>
            <string>Adware Medic</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>Utilities</string>
            <key>developer</key>
            <string>Thomas Reed</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%APPCAST_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>Unarchiver</string>
          <key>Arguments</key>
          <dict>
            <key>archive_path</key>
            <string>%pathname%</string>
            <key>archive_format</key>
            <string>tar_gzip</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            <key>purge_destination</key>
            <false/>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>Versioner</string>
          <key>Arguments</key>
          <dict>
            <key>input_plist_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist</string>
          </dict>
        </dict>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>dmg_root</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
            <key>dmg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
          </dict>
          <key>Processor</key>
          <string>DmgCreator</string>
        </dict>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
            <key>additional_makepkginfo_options</key>
            <array>
              <string>--destinationpath</string>
              <string>%APP_DESTINATION%</string>
            </array>
          </dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
