<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Firefox disk image and builds a package, copying your
'distribution/policies.json' file into the application bundle, then imports the package into Munki.</string>
    <key>Identifier</key>
    <string>com.github.wardsparadox.firefoxpolicies.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Firefox</string>
        <key>RELEASE</key>
        <string>latest</string>
        <key>LOCALE</key>
        <string>en_US</string>
        <key>NAME</key>
        <string>Firefox</string>
        <key>ORG_NAME</key>
        <string>Customised</string>
        <key>PKG_ID</key>
        <string>org.mozilla.firefox.pkg</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>applications/Mozilla</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
			<string>Mozilla Firefox is a free and open source web browser. This will also install configurations for the USC Labs.</string>
            <key>display_name</key>
            <string>Firefox</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.neilmartin83.pkg.FirefoxPolicies</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
          <dict>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
        <key>Processor</key>
          <string>MunkiImporter</string>
      </dict>
    </array>
</dict>
</plist>
